old/old_2/app/controllers/websites_controller.rb

  def create
   @w=params[:url]
   @email=params[:email]
@website = Website.new
@website.url=@w
@website.email=@email

if !( Website.exists?(url: @website.rectify ) and  Website.exists?(email: @email))
@website.save
---
SELECT  1 AS one FROM `websites` WHERE `websites`.`url` = 'https://sad.com' LIMIT 1
INSERT INTO `websites` (`url`, `created_at`, `updated_at`, `email`) VALUES ('https://sv.com', '2019-08-01 12:18:00', '2019-08-01 12:18:00', 'sv@sd.com')

def delete
   @w=Website.new
@w.url=params[:url]
   @email=params[:email]
@k=@w
@website = Website.where(email: @email)
---
SELECT `websites`.* FROM `websites` WHERE `websites`.`email` = 'sv@sd.com'