app/controllers/websites_controller.rb

SELECT  1 AS one FROM `websites` WHERE `websites`.`url` = 'https://sad.com' LIMIT 1
INSERT INTO `websites` (`url`, `created_at`, `updated_at`, `email`) VALUES ('https://sv.com', '2019-08-01 12:18:00', '2019-08-01 12:18:00', 'sv@sd.com')
---
  def create
require 'net/http'
   @w=params[:url]
   @email=params[:email]
@website = Website.new
@website.url=@w
@website.email=@email

if !( Website.exists?(url: @website.rectify ) and  Website.exists?(email: @email))

	k=@website.url
url = URI(k)
 response1 = Net::HTTP.get_response(url)
@website.code=response1.code
@website.save

SELECT `websites`.* FROM `websites` WHERE `websites`.`email` = 'sv@sd.com'
DELETE FROM `websites` WHERE `websites`.`id` = 13
---
def delete
   @w=Website.new
@w.url=params[:url]
   @email=params[:email]
@k=@w
@website = Website.where(email: @email)
c=0
@website.each do |p|
  if p.url == @w.rectify
    c=c+1
@l=Website.new
@l.url=p.url
@l.email=p.email

 p.destroy
Report.where("url = ?",@l.url ).delete_all